v2506/run/fcn-krxn/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

R 900.0e-6;
z 1.175;
n_R 200;
n_z 200;

scale       1;
halfAngle   1;

x           #eval "$R * cos(degToRad($halfAngle))";
y_pos       #eval "$R * sin(degToRad($halfAngle))";
y_neg       #eval "-1 * $y_pos";

vertices
(
    (0  0 0)        //0
    ($x $y_neg 0)   //1
    ($x $y_pos 0)   //2
    (0  0 $z)       //3
    ($x $y_neg $z)  //4
    ($x $y_pos $z)  //5
);

blocks
(
    hex (0 1 2 0 3 4 5 3) ($n_R 1 $n_z) simpleGrading 
    (
        (
            (0.99 0.05 0.05)   // 99% x-dir, 5% cells, expansion = 20
            (0.01 0.95 0.05)   // 1% x-dir, 95% cells, expansion = 20
        )
        1
        (
            (0.3 0.15 1)
            (0.2 0.6 1)
            (0.5 0.25 1)
        )
    )
);

edges
(
    arc 1 2 ($R 0 0)
    arc 4 5 ($R 0 $z)
);

boundary
(
    surface
    {
        type wall;
        faces
        (
            (1 2 5 4)
        );
    }

    inlet
    {
        type patch;
        faces
        (
            (0 2 1 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (3 4 5 3)
        );
    }
    wedge_lower
    {
        type wedge;
        faces
        (  
            (0 1 4 3)
        );
    }
    wedge_upper
    {
        type wedge;
        faces
        (
            (2 0 3 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
