v2506/run/fcn-krxn/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application         simpleFoam;
startFrom           latestTime;
startTime           0;
stopAt              endTime;
endTime             100;
deltaT              1;
writeControl        timeStep;
writeInterval       50;
purgeWrite          0;
writeFormat         ascii;
writePrecision      12;
writeCompression    off;
timeFormat          general;
timePrecision       12;
runTimeModifiable   yes;

libs
(
    "libexternalSpecieDiffusionResistance.so"
);

functions
{
    #include "FO_createScalarFields"
    #include "FO_scalarTransport"
    #include "FO_writeData"
}

// ************************************************************************* //